MongoDB/Workload B/Output_Test1_LOAD.txt
java -cp /home/ubuntu/ycsb-0.17.0/mongodb-binding/conf:/home/ubuntu/ycsb-0.17.0/conf:/home/ubuntu/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/home/ubuntu/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/ycsb-0.17.0/lib/core-0.17.0.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/home/ubuntu/ycsb-0.17.0/mongodb-binding/lib/logback-core-1.1.2.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -P workloads/workloadb -p recordcount=1000 -p mongodb.upsert=true -p mongodb.url=mongodb://primary:27017,secondary1:27017,secondary2:27017,secondary3:27017/?replicaSet=myReplicaSet -load
Command line: -db site.ycsb.db.MongoDbClient -s -P workloads/workloadb -p recordcount=1000 -p mongodb.upsert=true -p mongodb.url=mongodb://primary:27017,secondary1:27017,secondary2:27017,secondary3:27017/?replicaSet=myReplicaSet -load
YCSB Client 0.17.0

Loading workload...
Starting test.
2023-04-09 19:52:00:018 0 sec: 0 operations; est completion in 0 second
mongo client connection created with mongodb://primary:27017,secondary1:27017,secondary2:27017,secondary3:27017/?replicaSet=myReplicaSet
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2023-04-09 19:52:07:283 7 sec: 1000 operations; 136.18 current ops/sec; [CLEANUP: Count=1, Max=4615, Min=4612, Avg=4614, 90=4615, 99=4615, 99.9=4615, 99.99=4615] [INSERT: Count=1000, Max=132351, Min=3566, Avg=6661.92, 90=8775, 99=17663, 99.9=22351, 99.99=132351]
[OVERALL], RunTime(ms), 7349
[OVERALL], Throughput(ops/sec), 136.07293509320996
[TOTAL_GCS_G1_Young_Generation], Count, 3
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 24
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.3265750442237039
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 3
[TOTAL_GC_TIME], Time(ms), 24
[TOTAL_GC_TIME_%], Time(%), 0.3265750442237039
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 4614.0
[CLEANUP], MinLatency(us), 4612
[CLEANUP], MaxLatency(us), 4615
[CLEANUP], 95thPercentileLatency(us), 4615
[CLEANUP], 99thPercentileLatency(us), 4615
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 6661.917
[INSERT], MinLatency(us), 3566
[INSERT], MaxLatency(us), 132351
[INSERT], 95thPercentileLatency(us), 10615
[INSERT], 99thPercentileLatency(us), 17663
[INSERT], Return=OK, 1000